OdIfc.Utils.assignGlobalId(OdIfc.OdIfcInstance*)
\details
Assigns a generated global identifier to the "GlobalId" attribute  of an entity derived from an IfcRoot object.
\param pInst [in] A raw pointer to the IFC entity instance.
\returns true if the attribute "GlobalId" was successfully assigned; otherwise the method returns false.